W6D3/first_router_controller/app/controllers/users_controller.rb

    def index #get, shows everything for the user
     #     render plain: "I'm in the index action!"
     render json: User.all
---
SELECT "users".* FROM "users"

    def show #get Route parameters (e.g. the :id from /users/:id) # user have to specify to see the specific data entry
        render json: User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create #post
        # # user = User.find_by(id: params[:id])
        # user = User.new(user_params)

        # if user.save
        #     # user.update(user_params)
        #     redirect_to user_url(user)
        # else
        #     render json: user.errors.full_message, status:422
        # end
        # user = User.new(params.require(:user).permit(:name, :email))
        # # replace the `user_attributes_here` with the actual attribute keys
        # user.save!
        # render json: user
        #   .require(:user)
        user = User.new(params.require(:user).permit(:name, :email))
        if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Hwa Ryoeng"], ["email", "hkim@gmail.com"], ["created_at", "2020-10-29 22:37:08.195811"], ["updated_at", "2020-10-29 22:37:08.195811"]]

    def update #put/patch
        user = User.find(params[:id])
        if user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Walker"], ["updated_at", "2020-10-29 23:21:38.951881"], ["id", 4]]